{"intents": [{"tag": "greeting", "patterns": ["hi", "how there", "is anyone there", "hello", "Whats up","hey","sup","hyy"], "responses": [ "Hi there, what would you like to do..  general questions like(developers, technology etc), Awareness for crimes, file a report, inspect reports as inspector or want to register a new law"], "context_set": ""}, {"tag": "goodbye", "patterns": ["cya", "see you later", "goodbye", "i am Leaving", "have a Good day"," bye"], "responses": ["Be safe Be Aware ", "Have a good day ", "Goodbye!"], "context_set": ""}, {"tag": "developer", "patterns": ["who did dovelop you", "who made you", "how do you work","What you are","developer","general question"], "responses": ["I'm a chat-bot that was developed by CodeBeaters before some days. I'm written on language python. I analyze your requests and recognize the text. After that I work on some neural networks and give you the best fit response."], "context_set": ""}, {"tag": "molestation crime", "patterns": ["what is molestation", "what are the laws for molestation", "tell me something about molestation","molestation"], "responses": ["Any person who assaults a woman or uses criminal force on any woman with the intention to outrage her modesty is guilty of an offence under section 354 of the Indian Penal Code. He may also do so with the knowledge that by doing so he would be outraging the modesty of the woman. Any person who utters any word or makes any sound or gesture or exhibits any object with the intention that it will be seen or heard by such woman or will intrude up on her privacy is guilty of insulting the modesty of that woman. Any person may file a complaint and lodge an FIR against the offender in the nearest Police Station. The case can be tried by the Metropolitan Magistrate or a First Class or Second Class Judicial Magistrate."], "context_set": ""}, {"tag": "name", "patterns": ["what is your name", "what should I call you","who is this"], "responses": ["You can call me Alex.", "I'm Alex", "I'm your well-wisher.","it's Alex"], "context_set": ""}, {"tag": "register laws", "patterns": ["new law for crime", "register a new law","new law","update law"], "responses": ["admin"], "context_set": ""}, {"tag": "awareness", "patterns": ["tell me something", "tell me about any crime", "let me know something","tell me about some law","awareness from crime","awareness"], "responses": ["let you know something about molestation. Any person who assaults a woman or uses criminal force on any woman with the intention to outrage her modesty is guilty of an offence under section 354 of the Indian Penal Code. He may also do so with the knowledge that by doing so he would be outraging the modesty of the woman. Any person who utters any word or makes any sound or gesture or exhibits any object with the intention that it will be seen or heard by such woman or will intrude up on her privacy is guilty of insulting the modesty of that woman. Any person may file a complaint and lodge an FIR against the offender in the nearest Police Station. The case can be tried by the Metropolitan Magistrate or a First Class or Second Class Judicial Magistrate."], "context_set": ""},{"tag": "report a crime", "patterns": ["i want to report a crime", "report crime","crime register","file report"], "responses": ["register crime"], "context_set": ""},{"tag": "news", "patterns": ["play some news for me", "play news","news","news updats"], "responses": ["news"], "context_set": ""},{"tag": "inspector", "patterns": ["open inspection panel", "inspection panel","inspector window","inspection site","inspect","inspect reports as inspector"], "responses": ["inspection"], "context_set": ""},{"tag": "Emergency", "patterns" : ["emergency report","there is an emergency","emergency"], "responses": ["emergency"], "context_set": ""},{"tag": "Help", "patterns" : ["help"], "responses": ["If you want to interact with alex type-hello, If you want to register a report type- i want to register a report, If you want to inspect the report type-i want to inspect, If you want to update a law than type-update law, If  you want to study about any crime type- what is <crime nam> and if you want to quit an operation in between you just need to type quit and we will bring you back in the base procedure"], "context_set": ""},{"tag": "ok", "patterns" : ["ok","okk","hmm","yupp"], "responses": ["got it","cool","you are a nice person","thanks for interacting me","what more can i do for you..."], "context_set": ""}]}